{
    "breaking_news": [
        {
            "id": 1,
            "title": " ولایت باجوڑ",
            "content": "اتمان خیل کو فری زون قرار دیا گیا ہے۔ ولایت پشاور کو بھی فری زون قرار دیا گیا ہے۔",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368482_693962a2cba61.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:08:02"
        },
        {
            "id": 2,
            "title": "محمد خان حقانی",
            "content": ":  شیخ ابو محمد خان حقانی۔ شہید رحمت اللہ",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368575_693962ff4e0e0.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:09:35"
        },
        {
            "id": 3,
            "title": ":  منزل 8 جون 2025",
            "content": ":  تحریک طالبان پاکستان کا ڈیلی میگزین",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368616_69396328dcecc.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:10:16"
        },
        {
            "id": 4,
            "title": "ٹی ٹی پی کا مشن",
            "content": ":  ٹی ٹی پی کا بینر",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368661_69396355ac182.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:11:01"
        },
        {
            "id": 5,
            "title": "بریکنگ نیوز: الخندق آپریشن",
            "content": "شمالی وزیرستان کے علاقے اگمال میں سیکیورٹی فورسز پر حملہ",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368703_6939637f66553.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:11:43"
        },
        {
            "id": 6,
            "title": "پاکستانی فوج و افغانستان کی جنگ کے کچھ پہلو",
            "content": "پاکستانی فوج و افغانستان کی جنگ کے کچھ پہلوؤں کو سمجھنا لازمی ہے۔ پاکستانی فوج نے افغانستان پر ظلماً حملہ کیا، عاصم منیر کے پچھلے اتنے ماہ کی امریکہ یاترا، نایاب معدنیات کی فروخت، امریکہ کو اڈوں کی پیش کش اور اس کے بدلے میں سرزمینِ افغانستان میں مجاہدین کی سرکوبی کے لیے اسمریکی اجازت، حمایت اور مدد ثم اس سب کے نتیجے میں ایک حساس وقت پر جب افغانستان کے وزیرِ خارجہ ہندوستان کے دورے پر تھے، سیاسی چال چلتے ہوئے پاکستان فوج کا کابل پر حملہ، امارتِ اسلامیہ کا پاکستان فوج پر جوابی حملہ وغیرہ۔ اللہ کی شریعت میں جو حلال ہے وہ حلال ہے اور جو حرام ہے وہ حرام ہے، سیاہی خشک ہو چکی اور قلم رکھا جا چکا ہے۔ تا قیامت اب اگر امام مہدیؓ ہی کیوں نہ آ جائیں وہ اللہ کی شریعت کے پابند و تابع ہوں گے، معاشرت سے تجارت و معیشت تک اور جہاد و خلافت تک۔ امارتِ اسلامیہ نے اگر ہندوستان کے ساتھ تعلق بنایا ہے تو اس کی نوعیت ‏اصولاً تجارتی ہے، اب سوال یہاں سیاسی اٹھتا ہے نہ کہ شرعی، شرعی نکیر امارت پر تب ہو سکتی ہے جب امارت ہندوستان کے کفری اتحاد کا حصہ بن جائے (حاشا وکلّا) اور ان کی اتحادی بن کر مسلمانوں کے خلاف ظلم و تعدی پر آمادہ ہو جائے (فأعاذنا اللہ منہ)۔ جبکہ پاکستانی فوج پچھلے پچیس سال سے ‏امریکہ کی فرنٹ لائن اتحادی ہے اور کابل میں حملہ ہو یا ٹرمپ سے معدنیات و اڈوں کے بدلے عاصم منیر کی ڈیل، یہ سب امریکہ کے مفاد کی خاطر، اس کا اتحادی بن کر مسلمانوں کے خلاف کافروں کی مدد کے زمرے میں داخل ہے۔ لہٰذا پاکستانی فوج کا اس جنگ میں جرم بہت واضح اور بہت بڑا ہے، خاص کر کہ ‏جب پاکستانی فوج افغانستان کے عوامی مقامات، گھروں اور بازاروں کو نشانہ بنا رہی ہے۔ اب اس جنگ میں پاکستانی فوج کی اندھی حمایت، وطنی تعصب پر مبنی ہے، یہ جہالت اور عصبیت کی آواز ہے چاہے اس آواز کو اہلِ دین ہی آج کیوں نہ اٹھا رہے ہوں! مدینہ طیبہ میں انصار و مہاجرین کے درمیان ‏ایک نا خوشگوار واقعے پر رسولِ محبوب صلی اللہ علیہ وسلم نے اس کو جہالت و عصبیت ہی سے تعبیر فرمایا تھا، حالانکہ وہ خیر القرون کا زمانہ تھا۔ساتھ ہی کچھ افغانوں کا اس جنگ کو نظامِ اسلامی اور شرعی حدود کے دفاع کے بجائے پنجابیوں کے خلاف جنگ کا رخ دینا ‏اور پاکستان جو اہلِ افغانستان کا دارِ ہجرت، جہاد میں پاکستانی عوام جو افغانوں کے انصار رہے اور چھ لاکھ مسلمانوں کی شہادتوں کے نتیجے میں بننے والے ملک (اگرچہ وہاں اسلام نافذ نہ ہوا) کو سیدھا سیدھا اسرائیل کہہ دینا بھی ظلم ہے۔ پاکستانی ہو یا کوئی افغانی ہو، دونوں کو اللہ ‏اپنی شریعت کا اتباع اور شریعت کے نفاذ کا حکم دے رہا ہے۔ يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ‏اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ اے ایمان والو! اللہ کے لیے انصاف پر قائم رہنے والے اور انصاف کی گواہی دینے والے بنو، اور کسی قوم کی دشمنی تمہیں اس بات پر آمادہ نہ کرے کہ تم انصاف نہ کرو۔ ‏انصاف کیا کرو، یہی تقویٰ سے زیادہ قریب ہے۔ اور اللہ سے ڈرو، یقین جانو کہ اللہ تمہارے کاموں سے خوب واقف ہے۔",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368775_693963c77f83f.png",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:12:55"
        },
        {
            "id": 7,
            "title": "پکتیکا میں کرکٹ کھلاڑیوں پر پاکستانی فوجی حملہ",
            "content": "پکتیکا میں کرکٹ کھلاڑیوں پر پاکستانی فوج کا حملہ افغانستان کرکٹ بورڈ کے ذرائع نے خراسان آواز کو بتایا کہ پکتیکا میں پاکستانی فوج کے حملوں میں کرکٹ کلب کے آٹھ کھلاڑی شہید اور چار زخمی ہو گئے۔ کھلاڑی کھیل کے بعد پکتیکا کے مرکز سے تحصیل ارگون واپس آرہے تھے کہ وہاں ان پر حملہ کیا گیا۔",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368813_693963edc8713.png",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:13:33"
        },
        {
            "id": 8,
            "title": "یاد رکھو یہ وہ لوگ ہیں جنہوں نے فساد برپا کیا ہے۔",
            "content": "کافر اور ان کے سرغنہ نہ تو سلام کے لائق ہیں اور نہ کسی انعام کے، بلکہ وہ ہیں جنہوں نے سچے مومنوں کے لیے زمین کو جہنم بنا دیا ہے۔ لیکن چاپلوس اور کٹھ پتلی کیسے سمجھے",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368877_6939642d39a64.jpg",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:14:37"
        },
        {
            "id": 9,
            "title": "کمانڈر یاسر رحمہمااللّٰہ تعالیٰ کی شہادت",
            "content": "آج نہایت ہی افسوسناک خبر موصول ہوئی کہ تحریک طالبان پاکستان کے سابق نائب امیر محترم مفتی مزاحم اور انکے دست راست کمانڈر یاسر رحمها الله تعالی\" غداران اسلام کے ہاتھیوں شھید کر دیئے گئے ہیں ، انا للہ وانا الیہ راجعون \" اللهم اجرنا في مصيبتا واخلف لنا خيرا منهما ، اہلیان پاکستان اور عزیز مجاھد بہائیو! دین اسلام پر جان نچھاور کرنے کا یہ کوئی نیا واقعہ نہیں ہے ، اسلامی تاریخ اسطرح کے قربانیوں سے بھری پڑی ہے ، حضرت عمر اور علی رضی اللہ عنہما اور ان جیسے دیگر شخصیات کی شھادتیں بھی دشمنان اسلام کے غدر و خیانت کی نتیجہ میں پیش آئی تھیں ، رائیل انڈین آرمی آج جو رنگ تحریک طالبان پاکستان کے عظیم سپوت کی شھادت کو دینے کی مذموم کوشش کرتی ہے ، گویا مفتی صاحب کو باڈر کراس کرتے ہوئے ایک مقابلہ میں شھید کر دیا گیا ہے ، یہ سراسر جھوٹ اور فریب پر مبنی دعوی ہے ، یہ بزدل فوج مفتی صاحب اور انکے چابک دستے کا سامنا کرنے سے کوسوں دور رہا کرتے تھے ، بلکہ کئی بار دشمن کو پیٹھ پھیر کر بھاگنا پڑا ہے ۔ اصل بات یہ ہے کہ یہ عظیم کمانڈر امیر محترم مفتی ابو منصور عاصم حفظہ اللہ ( جو خود بھی محمد اللہ جنوبی زون کے ولایات کی براہ راست نگرانی میں مصروف ہیں) کی ھدایات کے مطابق پہلے ہی سے شمالی زون کی اٹھارہ ولایات کا جائزہ لینے اور وہاں کے کمانڈروں کو تحریک طالبان پاکستان کے لوائح ، اصول اور جنگی تکتیک وغیرہ سمجھانے کی خاطر سر گرمیوں میں مصروف تھے، مفتی مزاحم صاحب رحمہ اللہ نے محمد الله دشمنان اسلام کے مقابلہ میں مزاحمت کا پورا حق اداء کر لیا، اور ولایت باجوڑ سے ولایت دیر کی جانب ایک اہم مشن کے حوالے سفر کے دوران مفتی مزاحم صاحب اور کمانڈر یاسر صاحب نے اسی ولایت میں ایک غدارانہ کاروائی میں شھادت کا اعلی مقام حاصل کر لیا ، اور ہمیں اپنے زمہ داران اور کمانڈر ساتھیوں کی شہادت پر فخر ہے اور فوجی جرنیلوں کی طرح بلوں میں بیٹھ کر عام سپاہیوں کو مروانے کی عادت یہ صرف پاکستانی فوج کا خاصہ ہے اور الحمد للہ تحریک طالبان پاکستان کے کئی اہم کمانڈرز دشمن کے شانہ بشانہ شہید ہوئے ۔ بوکھلاہٹ کے شکار دشمن نے ایک ہی واقعہ کو کئی رنگ دینے کی ناکام کوشش کی ، کبھی ولایت باجوڑ ڈمہ ڈولہ \" پاکستان چوک\" کا ذکر کرتا ہے تو کبھی باڈر پر دراندازی کے دوران شہید کر دیئے جانے کا تو کبھی خار تحصیل کے علاقے راغاگان کا ذکر کرتا ہے مگر حقیقت چھپائے کھاں چھپ سکتی ہے ، جب دشمن بزدلی اور بوکھلاہٹ کا شکار ہوتا ہے تو پھر یوں جھوٹ پر جھوٹ بولنے کا عادی بن جاتا ہے ،",
            "timestamp": "Just Now",
            "image": "news_images\/news_1765368920_693964586f47d.png",
            "priority": "medium",
            "attribution": "",
            "date_added": "2025-12-10 12:15:20"
        }
    ],
    "live_news": [],
    "news_location": []
}